wisteria-1c/Конфигурация/Catalogs/ЕдиницыИзмеренияВЕТИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЕдиницыИзмеренияВЕТИС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторВерсии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыВерсионныхОбъектовВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмеренияВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяЗагрузка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЕдиницаИзмерения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/ЕдиницыИзмеренияВЕТИС/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	РежимВыбора = Параметры.РежимВыбора;

	Элементы.ПоискНеНастроен.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
	Элементы.ПоискНеНастроен.ОтображениеСостояния.Текст = НСтр(
		"ru = 'Элементы классификатора не выведены. Для отображения элементов нажмите на кнопку Заполнить.'");
	Элементы.ПоискНеНастроен.ОтображениеСостояния.Видимость = Истина;
	
	ЦветГиперссылки = ЦветаСтиля.ЦветГиперссылкиГосИС;
	
	ПравоИзменения = ПравоДоступа("Изменение", Метаданные.Справочники.ЕдиницыИзмеренияВЕТИС);
	Элементы.ЕдиницыИзмеренияЗагрузить.Видимость                = ПравоИзменения;
	Элементы.ЕдиницыИзмеренияКонтекстноеМенюЗагрузить.Видимость = ПравоИзменения;
	
	ЭтоИнтерфейс85 = ОбщегоНазначенияИСКлиентСерверПовтИсп.ЭтоИнтерфейс85();
	Если РежимВыбора Тогда
		Элементы.Список.РежимВыделения           = РежимВыделенияТаблицы.Одиночный;
		Элементы.ЕдиницыИзмерения.РежимВыделения = РежимВыделенияТаблицы.Одиночный;
		Если Не ЭтоИнтерфейс85 Тогда
			Элементы.Список.РежимВыбора           = Истина;
			Элементы.НазначенияГрузов.РежимВыбора = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ИнтеграцияИС.УстановитьВидимостьЭлементовТакси85(ЭтотОбъект);
	ОтображатьКоманднуюПанель = ЭтоИнтерфейс85;
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступностьКнопкиВыбрать();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ЕдиницыИзмеренияВЕТИС" Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаЗагружено;
		ПриСменеОсновнойСтраницы();
		Элементы.Список.Обновить();
		Элементы.Список.ТекущаяСтрока = Параметр;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НайтиПродукцию(Команда)
	
	ОчиститьСообщения();
	
	ЗагрузитьСписок(1);
	Элементы.СтраницыПоиска.ТекущаяСтраница = Элементы.СтраницаРезультатПоиска;
	УстановитьВидимостьДоступностьКнопкиВыбрать();
	
КонецПроцедуры

&НаКлиенте
Процедура НавигацияСтраницаПервая(Команда)
	
	ПерейтиПоНомеруСтраницы(1);
	
КонецПроцедуры

&НаКлиенте
Процедура НавигацияСтраницаПредыдущая(Команда)
	ПерейтиПоНомеруСтраницы(СписокНомерСтраницы-1);
КонецПроцедуры

&НаКлиенте
Процедура НавигацияСтраницаТекущаяСтраница(Команда)
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("МаксимальныйНомерСтраницы", КоличествоСтраниц);
	ПараметрыОткрытияФормы.Вставить("НомерСтраницы",             СписокНомерСтраницы);
	
	ОткрытьФорму(
		"Обработка.КлассификаторыВЕТИС.Форма.ПереходКСтраницеПоНомеру",
		ПараметрыОткрытияФормы,
		ЭтотОбъект,,,,
		Новый ОписаниеОповещения("ПослеВыбораНомераСтраницы", ЭтотОбъект));
		
КонецПроцедуры

&НаКлиенте
Процедура НавигацияСтраницаСледующая(Команда)
	
	ПерейтиПоНомеруСтраницы(СписокНомерСтраницы + 1);
	
КонецПроцедуры

&НаКлиенте
Процедура НавигацияСтраницаПоследняя(Команда)
	
	ПерейтиПоНомеруСтраницы(КоличествоСтраниц);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораНомераСтраницы(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПерейтиПоНомеруСтраницы(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	ОбрабатываемыеСтроки = Элементы.ЕдиницыИзмерения.ПолучитьСтрокиДляОбработки();
	Если ОбрабатываемыеСтроки.Количество() = 1 Тогда
		
		ТекущиеДанные = ЕдиницыИзмерения.НайтиПоИдентификатору(ОбрабатываемыеСтроки[0]);
		ПараметрыОткрытия = Новый Структура;
		Если ЗначениеЗаполнено(ТекущиеДанные.СсылкаВБазе) Тогда
			Возврат;
		КонецЕсли;
		ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ТекущаяСтрокаСтруктурой(ТекущиеДанные));
		ОткрытьФорму("Справочник.ЕдиницыИзмеренияВЕТИС.ФормаОбъекта", ПараметрыОткрытия, ЭтотОбъект, УникальныйИдентификатор);
		
	ИначеЕсли ОбрабатываемыеСтроки.Количество() > 0 Тогда
		
		ИдентификаторыСтрок = Новый Массив;
		
		Для Каждого ОбрабатываемаяСтрока Из ОбрабатываемыеСтроки Цикл
			
			ДанныеОбрабатываемойСтроки = ЕдиницыИзмерения.НайтиПоИдентификатору(ОбрабатываемаяСтрока);
			Если ЗначениеЗаполнено(ДанныеОбрабатываемойСтроки.СсылкаВБазе) Тогда
				Продолжить;
			КонецЕсли;
			ИдентификаторыСтрок.Добавить(ОбрабатываемаяСтрока);
			
		КонецЦикла;
		
		КоличествоСтрок = ИдентификаторыСтрок.Количество();
		Если ИдентификаторыСтрок.Количество() > 0 Тогда
			ЗагрузитьЭлементыКлассификатораНаСервере(ИдентификаторыСтрок);
			Элементы.Список.Обновить();
		КонецЕсли;
		
		ОповеститьПользователяОЗагрузке(КоличествоСтрок);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИзТекущегоСписка(Команда)
	
	ИмяЭлементаСписок = ИмяСпискаПоТекущейСтранице(ЭтотОбъект);
	Если ИмяЭлементаСписок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы[ИмяЭлементаСписок].ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ОбработкаВыбораЗначенияСписка(ТекущиеДанные, ИмяЭлементаСписок);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ПриСменеОсновнойСтраницы();
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимВыбора Тогда
		ОповеститьОВыборе(ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ЕдиницыИзмерения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаВыбораЗначенияСписка(ТекущиеДанные, "Список");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	УстановитьВидимостьДоступностьКнопкиВыбрать();
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницыИзмеренияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ЕдиницыИзмерения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимВыбора Тогда
		ОбработкаВыбораЗначенияСписка(ТекущиеДанные, "ЕдиницыИзмерения");
	Иначе
		ПараметрыОткрытия = Новый Структура;
		Если ЗначениеЗаполнено(ТекущиеДанные.СсылкаВБазе) Тогда
			ПараметрыОткрытия.Вставить("Ключ", ТекущиеДанные.СсылкаВБазе);
		Иначе
			ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ТекущаяСтрокаСтруктурой(ТекущиеДанные));
		КонецЕсли;
		ОткрытьФорму("Справочник.ЕдиницыИзмеренияВЕТИС.ФормаОбъекта", ПараметрыОткрытия, ЭтаФорма, УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницыИзмеренияВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ЕдиницыИзмерения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаВыбораЗначенияСписка(ТекущиеДанные, "ЕдиницыИзмерения");
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницыИзмеренияПриАктивизацииСтроки(Элемент)
	УстановитьВидимостьДоступностьКнопкиВыбрать();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
КонецПроцедуры

#Область НастройкаЭлементовФормы

&НаКлиенте
Процедура ПерейтиПоНомеруСтраницы(НомерСтраницы)
	
	ОчиститьСообщения();
	
	Если НомерСтраницы < 1
		ИЛИ НомерСтраницы > КоличествоСтраниц Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьСписок(НомерСтраницы);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЗаголовокКомандыНавигации()
	КолвоСтраницНадпись = ?(КоличествоСтраниц=0,1,КоличествоСтраниц);
	Элементы.НавигацияСтраницаТекущаяСтраница.Заголовок =
		СтрШаблон(
			НСтр("ru = 'Страница %1 из %2'"),
			СписокНомерСтраницы, КолвоСтраницНадпись);
КонецПроцедуры

&НаКлиенте
Процедура ПриСменеОсновнойСтраницы()
	
	УстановитьВидимостьДоступностьКнопкиВыбрать();
	
КонецПроцедуры

#КонецОбласти

#Область ОбменСВЕТИС

&НаСервере
Процедура ЗагрузитьСписок(НомерСтраницы)
	
	Результат = ПрочиеКлассификаторыВЕТИСВызовСервера.СписокЕдиницИзмерения(НомерСтраницы);
	
	Если ЗначениеЗаполнено(Результат.ТекстОшибки) Тогда
		ОбщегоНазначения.СообщитьПользователю(Результат.ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ЕдиницыИзмерения.Очистить();
	Для Каждого СтрокаТЧ Из Результат.Список Цикл
		
		НоваяСтрока = ЕдиницыИзмерения.Добавить();
		НоваяСтрока.Активность    = СтрокаТЧ.active;
		НоваяСтрока.Актуальность  = СтрокаТЧ.last;
		НоваяСтрока.GUID          = СтрокаТЧ.GUID;
		НоваяСтрока.UUID          = СтрокаТЧ.UUID;
		НоваяСтрока.Наименование  = СтрокаТЧ.Name;
		НоваяСтрока.ДатаСоздания  = СтрокаТЧ.createDate;
		НоваяСтрока.ДатаИзменения = СтрокаТЧ.updateDate;
		НоваяСтрока.БазоваяЕдиницаGUID = СтрокаТЧ.commonUnitGuid;
		НоваяСтрока.Коэффициент        = СтрокаТЧ.factor;
		
		НоваяСтрока.НаименованиеПолное = СтрокаТЧ.fullName;
		НоваяСтрока.Статус = ИнтеграцияВЕТИСПовтИсп.СтатусВерсионногоОбъекта(СтрокаТЧ.status);
		
	КонецЦикла;
	
	ОпределитьНаличиеСсылокВБазе();
	
	ОбщееКоличество     = Результат.ОбщееКоличество;
	СписокНомерСтраницы = НомерСтраницы;
	КоличествоСтраниц   = Результат.КоличествоСтраниц;
	
	СформироватьЗаголовокКомандыНавигации();
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьЭлементКлассификатора(GUIDЭлемента)
	
	Возврат ИнтеграцияВЕТИС.ЕдиницаИзмерения(GUIDЭлемента);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТекущаяСтрокаСтруктурой(ТекущиеДанные)
	СтруктураЗаполнения = Новый Структура();
	СтруктураЗаполнения.Вставить("Наименование",        ТекущиеДанные.Наименование);
	СтруктураЗаполнения.Вставить("Идентификатор",       ТекущиеДанные.GUID);
	СтруктураЗаполнения.Вставить("ИдентификаторВерсии", ТекущиеДанные.UUID);
	СтруктураЗаполнения.Вставить("Статус",              ТекущиеДанные.Статус);
	СтруктураЗаполнения.Вставить("НаименованиеПолное",  ТекущиеДанные.НаименованиеПолное);
	СтруктураЗаполнения.Вставить("БазоваяЕдиницаGUID",  ТекущиеДанные.БазоваяЕдиницаGUID);
	СтруктураЗаполнения.Вставить("Коэффициент",         ТекущиеДанные.Коэффициент);
	
	Возврат СтруктураЗаполнения
	
КонецФункции

#КонецОбласти

#Область ПроверкаНаличияЭлементовКлассификатораВБазе

&НаСервере
Процедура ОпределитьНаличиеСсылокВБазе()
	
	ТаблицаФормы = ЭтаФорма.ЕдиницыИзмерения;
	Если ТаблицаФормы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивИдентификаторов = ТаблицаФормы.Выгрузить(, "GUID").ВыгрузитьКолонку("GUID");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЕдиницыИзмеренияВЕТИС.Идентификатор КАК Идентификатор,
	|	ЕдиницыИзмеренияВЕТИС.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЕдиницыИзмеренияВЕТИС КАК ЕдиницыИзмеренияВЕТИС
	|ГДЕ
	|	ЕдиницыИзмеренияВЕТИС.Идентификатор В(&МассивИдентификаторов)";
	
	Запрос.УстановитьПараметр("МассивИдентификаторов", МассивИдентификаторов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПараметрыПоиска = Новый Структура("GUID");
	
	Пока Выборка.Следующий() Цикл
		
		ПараметрыПоиска.GUID = Выборка.Идентификатор;
		
		НайденныеСтроки = ТаблицаФормы.НайтиСтроки(ПараметрыПоиска);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НайденнаяСтрока.ЕстьВБазе = 1;
			НайденнаяСтрока.СсылкаВБазе = Выборка.Ссылка;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьЭлементыКлассификатораНаСервере(ИдентификаторыСтрок)
	
	Для Каждого ИдентификаторСтроки Из ИдентификаторыСтрок Цикл
		
		СтрокаКлассификатора = ЕдиницыИзмерения.НайтиПоИдентификатору(ИдентификаторСтроки);
		НовыйЭлемент = ЗагрузитьЭлементКлассификатора(СтрокаКлассификатора.GUID);
		
		СтрокаКлассификатора.ЕстьВБазе = 1;
		СтрокаКлассификатора.СсылкаВБазе = НовыйЭлемент.Ссылка;
		
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ОповеститьПользователяОЗагрузке(КоличествоОбработанных)
	
	ТекстЗаголовка = НСтр("ru='Загрузка из классификатора'");
	ТекстСообщения = СтрШаблон(НСтр("ru='Загружено (%1)'"), КоличествоОбработанных);
	
	ПоказатьОповещениеПользователя(ТекстЗаголовка,, ТекстСообщения, БиблиотекаКартинок.Информация32ГосИС);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура УстановитьВидимостьДоступностьКнопкиВыбрать()
	
	Элементы.ФормаВыбратьИзТекущегоСписка.Видимость = РежимВыбора;
	Если РежимВыбора Тогда
		
		ИмяЭлементаСписок = ИмяСпискаПоТекущейСтранице(ЭтотОбъект);
		Если ИмяЭлементаСписок = Неопределено Тогда
			ДоступностьКоманды = Ложь;
		Иначе
			ТекущиеДанные = Элементы[ИмяЭлементаСписок].ТекущиеДанные;
			ДоступностьКоманды = ТекущиеДанные <> Неопределено;
		КонецЕсли;
		
		Элементы.ФормаВыбратьИзТекущегоСписка.Доступность = ДоступностьКоманды;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИмяСпискаПоТекущейСтранице(Форма)
	
	Элементы = Форма.Элементы;
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаЗагружено Тогда
		Возврат "Список";
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаКлассификатор
		И  Элементы.СтраницыПоиска.ТекущаяСтраница = Элементы.СтраницаРезультатПоиска Тогда
		Возврат "ЕдиницыИзмерения";
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбораЗначенияСписка(ВыбраннаяСтрока, ИмяСписка)
	
	Если ТипЗнч(ВыбраннаяСтрока) = Тип("ДанныеФормыСтруктура")
		Или ТипЗнч(ВыбраннаяСтрока) = Тип("ДанныеФормыЭлементКоллекции") Тогда
		ДанныеСтроки = ВыбраннаяСтрока;
	Иначе
		ДанныеСтроки = Элементы[ИмяСписка].ДанныеСтроки(ВыбраннаяСтрока);
	КонецЕсли;
	
	Если ИмяСписка = "Список" Тогда
		ОповеститьОВыборе(ДанныеСтроки.Ссылка);
	Иначе
		Если ЗначениеЗаполнено(ДанныеСтроки.СсылкаВБазе) Тогда
			ОповеститьОВыборе(ДанныеСтроки.СсылкаВБазе);
		Иначе
			ОповеститьОВыборе(ЗагрузитьЭлементКлассификатора(ДанныеСтроки.GUID));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
